Revit 2027 API
IFCAnyHandle.GetHashCode Method
 Gets the integer value of the id as hash code
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override int GetHashCode()
Public Overrides Function GetHashCode As Integer
public:
virtual int GetHashCode() override
abstract GetHashCode : unit -> int
override GetHashCode : unit -> int
Return Value
Int32
See Also
Reference
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace